Fireflyluo/CH32V208_dome/dynamic_loading/sdk/Debug/debug.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : debug.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2023/10/24
 * Description        : This file contains all the functions prototypes for UART
 *                      Printf , Delay functions.
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#ifndef __DEBUG_H
#define __DEBUG_H

#include "stdio.h"
#include "ch32v20x.h"

#ifdef __cplusplus
extern "C" {
#endif

/* UART Printf Definition */
#define DEBUG_UART1    1
#define DEBUG_UART2    2
#define DEBUG_UART3    3

#define DEBUG_UART1_IT 4
#define DEBUG_UART2_IT 5
#define DEBUG_UART3_IT 6
#define DEBUG_UART3_DMA 7
#define DEBUG_UART2_DMA 8
/* DEBUG UATR Definition */
#ifndef DEBUG
#define DEBUG DEBUG_UART2_IT
#endif

/* SDI Printf Definition */
#define SDI_PR_CLOSE 0
#define SDI_PR_OPEN  1

#ifndef SDI_PRINT
#define SDI_PRINT SDI_PR_CLOSE
#endif

#if (DEBUG == DEBUG_UART3_DMA || DEBUG == DEBUG_UART2_DMA)
 #ifndef DEBUG_UART_RX_BUF_SIZE
 #define DEBUG_UART_RX_BUF_SIZE 1024u
 #endif
#else
 #ifndef DEBUG_UART_RX_BUF_SIZE
 #define DEBUG_UART_RX_BUF_SIZE 512u
 #endif
#endif

#ifndef DEBUG_UART_DMA_HALF_SIZE
#define DEBUG_UART_DMA_HALF_SIZE 256u
#endif

void Delay_Init(void);
void Delay_Us(uint32_t n);
void Delay_Ms(uint32_t n);
void USART_Printf_Init(uint32_t baudrate);
void SDI_Printf_Enable(void);
void Debug_UART_RxFlush(void);
uint16_t Debug_UART_RxAvailable(void);
uint16_t Debug_UART_RxRead(uint8_t *out, uint16_t max_len);
uint8_t Debug_UART_RxGetByte(uint8_t *out);
uint32_t Debug_UART_RxDropped(void);
void Debug_UART_SpeedTest(uint32_t duration_sec);

#if (DEBUG)
#define PRINT(format, ...) printf(format, ##__VA_ARGS__)
#else
#define PRINT(X...)
#endif

#ifdef __cplusplus
}
#endif

#endif
